#Pandas Series

In [1]:
import pandas as pd

In [2]:
a = [1,4,3,7,2,6,3]
a

[1, 4, 3, 7, 2, 6, 3]

In [3]:
type(a)

list

In [4]:
a = pd.Series(a)
type(a)

pandas.core.series.Series

In [5]:
a

0    1
1    4
2    3
3    7
4    2
5    6
6    3
dtype: int64

In [6]:
a.max()

7

In [7]:
a.min()

1

In [8]:
a.sort_values(ascending=False)

3    7
5    6
1    4
2    3
6    3
4    2
0    1
dtype: int64

In [9]:
a.sort_values(ascending=True, inplace=True)

In [10]:
a

0    1
4    2
2    3
6    3
1    4
5    6
3    7
dtype: int64

In [11]:
a[:4]

0    1
4    2
2    3
6    3
dtype: int64

In [12]:
a[4:]

1    4
5    6
3    7
dtype: int64

# Pandas DataFrames

* Load a pandas DataFrame
* Saving a DataFrame to a Commma Separated File (CSV)
* Create or turn other data types into a DataFrame
* Examine DataFrame data
* Indexing and selecting segments/slicing of our Data Frame
* Slicing using iloc
* Numeric Operations on Series
* Pandas DataFrames
* Descriptive Stats on series
* Descriptive Stats on DataFrames
* Filtering using Boolean Operations
* Finding empty cells using isnull()
* Combining Boolean Filtering

## Loading our data from a github source

In [13]:
import pandas as pd

# Load our CSV file using pandas
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv"
df = pd.read_csv(file_name)

df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [14]:
df.head(10)

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [15]:
# Saving to a CSV file
df.to_csv("myDataFrame2.csv")

# Of even an excel file
df.to_excel("myDataFrame2.xlsx")

In [16]:
# Explore the first 5 lines of our dataframe

df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

**Description of the columns**

* pclass: class of travel
* name: full name of the passenger
* sex: gender
* age: numerical age
* sibsp: # of siblings/spouse aboard
* parch: number of parents/child aboard
* ticket: ticket number
* fare: cost of the ticket
* cabin: location of room
* emarked: port that the passenger embarked at (C - Cherbourg, S - Southampton, Q = Queenstown)
* survived: survial metric (0 - died, 1 - survived)

## Creating dataframes from non csv sources. 
#### DataFrames can loaded from excel sheets, python lists, dictionaries and more!

In [17]:
# Create a list
list_a = ['a', 'b', 'c']
list_a

['a', 'b', 'c']

In [18]:
# 
df_a = pd.DataFrame(list_a)
df_a

   0
0  a
1  b
2  c

In [19]:
dict_df = pd.DataFrame({
    'http_status': [200,200,404,404,301],
    'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]})
dict_df

   http_status  response_time
0          200           0.04
1          200           0.02
2          404           0.07
3          404           0.08
4          301           1.00

# Examining our DataFrames

In [20]:
# View the last 10 lines
df.tail(10)

      pclass                                     name  ... embarked  survived
1299       3                      Yasbeck, Mr. Antoni  ...        C         0
1300       3  Yasbeck, Mrs. Antoni (Selini Alexander)  ...        C         1
1301       3                     Youseff, Mr. Gerious  ...        C         0
1302       3                        Yousif, Mr. Wazli  ...        C         0
1303       3                    Yousseff, Mr. Gerious  ...        C         0
1304       3                     Zabour, Miss. Hileni  ...        C         0
1305       3                    Zabour, Miss. Thamine  ...        C         0
1306       3                Zakarian, Mr. Mapriededer  ...        C         0
1307       3                      Zakarian, Mr. Ortin  ...        C         0
1308       3                       Zimmerman, Mr. Leo  ...        S         0

[10 rows x 11 columns]

In [21]:
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [23]:
df.dtypes

pclass        int64
name         object
sex          object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
cabin        object
embarked     object
survived      int64
dtype: object

In [24]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [25]:
# viewing one column
df['name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

# Indexing and selecting segments of our Data Frame

In [26]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [27]:
# df.loc[row_label, column_label]

df.loc[1,"name"]

'Allison, Master. Hudson Trevor'

In [28]:
# Slicing an entire column

df.loc[:,"name"]

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [29]:
names = df.loc[:,"name"]

In [30]:
names.head()

0                      Allen, Miss. Elisabeth Walton
1                     Allison, Master. Hudson Trevor
2                       Allison, Miss. Helen Loraine
3               Allison, Mr. Hudson Joshua Creighton
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Name: name, dtype: object

In [31]:
# Slicing a row

df.loc[0,:]

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                  29.0
sibsp                                   0
parch                                   0
ticket                              24160
fare                             211.3375
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

# Slicing using iloc

### df.iloc[row_index, column_index]

* **loc**: label based selection
* **iloc**: integer position based selection

In [32]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [33]:
df.iloc[0,1]

'Allen, Miss. Elisabeth Walton'

In [34]:
df.iloc[0]

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                  29.0
sibsp                                   0
parch                                   0
ticket                              24160
fare                             211.3375
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

### Note: A 1-Dim pandas objects is a series. A 2-Dim pandas object is a dataframe.

In [35]:
# Slicing mulitple columns

df.loc[:,["name", "sex"]]

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [36]:
# An alternative way of slicing columns 

df[["name", "sex"]]

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [37]:
# Slicing rows is similar as well

df.loc[2:4,:]

   pclass                                             name  ... embarked  survived
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[3 rows x 11 columns]

# Numeric Operations on Series

In [38]:
# let's create a simple DataFrame

simple_df = pd.DataFrame({
    'a': [1,2,3,4,5],
    'b': [5, 15, 10, 20, 15]})
simple_df

   a   b
0  1   5
1  2  15
2  3  10
3  4  20
4  5  15

In [39]:
# Let's extract a series for 'a' and 'b'

a = simple_df['a']
a

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [40]:
b = simple_df['b']
b

0     5
1    15
2    10
3    20
4    15
Name: b, dtype: int64

In [41]:
c = a + b
c

0     6
1    17
2    13
3    24
4    20
dtype: int64

# Descriptive Stats on series

In [42]:
a.max()

5

In [43]:
a.min()

1

In [44]:
a.mean()

3.0

In [45]:
a.median()

3.0

In [46]:
b.mode()

0    15
dtype: int64

In [47]:
b.sum()

65

In [48]:
b

0     5
1    15
2    10
3    20
4    15
Name: b, dtype: int64

In [49]:
b.value_counts()

15    2
5     1
10    1
20    1
Name: b, dtype: int64

In [50]:
b.describe()

count     5.000000
mean     13.000000
std       5.700877
min       5.000000
25%      10.000000
50%      15.000000
75%      15.000000
max      20.000000
Name: b, dtype: float64

In [51]:
# use describe on a coloumn of data in titanic dataset

df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [52]:
df['sex'].describe()

# count - number of rows or values in that column
# unique - number of unique categories in the column
# top - most populous category
# freq - count of the most popular category

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [53]:
df['pclass'].unique()

array([1, 2, 3])

# Descriptive Stats on DataFrames

In [54]:
df[["fare","age"]].mean()

fare    33.295479
age     29.881135
dtype: float64

In [55]:
# Specifying the axies
# Note Axis = 0 is used by default and calculates the column statistics

df[["fare","age"]].mean(axis=0)

fare    33.295479
age     29.881135
dtype: float64

### Visualizing Axis
```
+------------+---------+--------+
|            |  A      |  B     |
+------------+---------+---------
|      0     | 10      | 15     |----axis=1----->
+------------+---------+--------+
             |         |
             | axis=0  |
             ↓         ↓
```

In [56]:
# if we use axis = 1, we are calculating the row statistics
# Below is a sample.

df[["fare","age"]].mean(axis=1)

0       120.16875
1        76.23335
2        76.77500
3        90.77500
4        88.27500
          ...
1304     14.47710
1305     14.45420
1306     16.86250
1307     17.11250
1308     18.43750
Length: 1309, dtype: float64

In [57]:
# More examples

df.mean(numeric_only=True)

pclass       2.294882
age         29.881135
sibsp        0.498854
parch        0.385027
fare        33.295479
survived     0.381971
dtype: float64

# Filtering using Boolean Operations

In [58]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [59]:
df['pclass'] == 1

0        True
1        True
2        True
3        True
4        True
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: pclass, Length: 1309, dtype: bool

In [60]:
df['age'] > 70

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [61]:
# Viewing on those that are true

df[df['age'] > 70]

      pclass  ... survived
9          1  ...        0
14         1  ...        1
61         1  ...        1
135        1  ...        0
727        3  ...        0
1235       3  ...        0

[6 rows x 11 columns]

In [62]:
# Filtering on exact cell values

df[df['name'] == 'Barkworth, Mr. Algernon Henry Wilson']

    pclass                                  name   sex  ...  cabin  embarked  survived
14       1  Barkworth, Mr. Algernon Henry Wilson  male  ...    A23         S         1

[1 rows x 11 columns]

# Finding empty cells using isnull()

In [63]:
df.isnull()

      pclass   name    sex    age  ...   fare  cabin  embarked  survived
0      False  False  False  False  ...  False  False     False     False
1      False  False  False  False  ...  False  False     False     False
2      False  False  False  False  ...  False  False     False     False
3      False  False  False  False  ...  False  False     False     False
4      False  False  False  False  ...  False  False     False     False
...      ...    ...    ...    ...  ...    ...    ...       ...       ...
1304   False  False  False  False  ...  False   True     False     False
1305   False  False  False   True  ...  False   True     False     False
1306   False  False  False  False  ...  False   True     False     False
1307   False  False  False  False  ...  False   True     False     False
1308   False  False  False  False  ...  False   True     False     False

[1309 rows x 11 columns]

In [64]:
df['cabin'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
1304     True
1305     True
1306     True
1307     True
1308     True
Name: cabin, Length: 1309, dtype: bool

In [65]:
df[df['cabin'].isnull()]

      pclass                          name     sex  ...  cabin  embarked  survived
9          1       Artagaveytia, Mr. Ramon    male  ...    NaN         C         0
13         1  Barber, Miss. Ellen "Nellie"  female  ...    NaN         S         1
15         1           Baumann, Mr. John D    male  ...    NaN         S         0
23         1         Bidois, Miss. Rosalie  female  ...    NaN         C         1
25         1           Birnbaum, Mr. Jakob    male  ...    NaN         C         0
...      ...                           ...     ...  ...    ...       ...       ...
1304       3          Zabour, Miss. Hileni  female  ...    NaN         C         0
1305       3         Zabour, Miss. Thamine  female  ...    NaN         C         0
1306       3     Zakarian, Mr. Mapriededer    male  ...    NaN         C         0
1307       3           Zakarian, Mr. Ortin    male  ...    NaN         C         0
1308       3            Zimmerman, Mr. Leo    male  ...    NaN         S         0

[1014 rows x 11 columns]

In [66]:
df[df['cabin'].notnull()]

      pclass  ... survived
0          1  ...        1
1          1  ...        1
2          1  ...        0
3          1  ...        0
4          1  ...        0
...      ...  ...      ...
1189       3  ...        1
1217       3  ...        0
1230       3  ...        0
1231       3  ...        0
1249       3  ...        0

[295 rows x 11 columns]

# Combining Boolean Filtering

In [67]:
over_60 = df['age'] > 60
cabin_exists = df['cabin'].notnull()

In [68]:
over_60_cabin_exists = over_60 * cabin_exists

In [69]:
df[over_60_cabin_exists]

     pclass  ... survived
6         1  ...        1
14        1  ...        1
61        1  ...        1
78        1  ...        1
81        1  ...        0
83        1  ...        1
115       1  ...        0
135       1  ...        0
205       1  ...        0
221       1  ...        0
252       1  ...        0
279       1  ...        0
284       1  ...        1
285       1  ...        0
286       1  ...        0
287       1  ...        0
300       1  ...        0
303       1  ...        0

[18 rows x 11 columns]

In [70]:
over_60_or_under_5 = (df['age'] > 60) | (df['age'] < 5)

In [71]:
df[over_60_or_under_5]

      pclass                                  name  ... embarked  survived
1          1        Allison, Master. Hudson Trevor  ...        S         1
2          1          Allison, Miss. Helen Loraine  ...        S         0
6          1     Andrews, Miss. Kornelia Theodosia  ...        S         1
9          1               Artagaveytia, Mr. Ramon  ...        C         0
14         1  Barkworth, Mr. Algernon Henry Wilson  ...        S         1
...      ...                                   ...  ...      ...       ...
1225       3                    Storey, Mr. Thomas  ...        S         0
1230       3            Strom, Miss. Telma Matilda  ...        S         0
1235       3                   Svensson, Mr. Johan  ...        S         0
1240       3       Thomas, Master. Assad Alexander  ...        C         1
1261       3                Turkula, Mrs. (Hedwig)  ...        S         1

[84 rows x 11 columns]

# NOTE:

#### a & b (pandas) = a and b (python)
#### a | b (pandas) = a or b (python)